#include "mulprec.h"
#include <stdio.h>
#include <time.h>
#include <stdlib.h>


///////////////////////////////////////////////////////////////////
//概要：多倍長演算用の数字を0に初期化する
//引数：struct NUMBER* a : 初期化する数字
//戻値：なし
///////////////////////////////////////////////////////////////////
void clearByZero(struct NUMBER* a)
{
	int i;
	for (i = 0; i < KETA; i++)
		a->n[i] = 0;
	a->sign = 1;
}


///////////////////////////////////////////////////////////////////
//概要：多倍長演算用の数字を表示する
//引数：struct NUMBER* a : 表示する数字
//戻値：なし
///////////////////////////////////////////////////////////////////
void dispNumber(struct NUMBER* a)
{
	int i;
	if (a->sign >= 0)
		putchar('+');
	else
		putchar('-');

	for (i = KETA - 1; i >= 0; i--)
		printf(" %2d", a->n[i]);        //数字確認用
}


///////////////////////////////////////////////////////////////////
//概要：多倍長演算用の数字に乱数を格納する
//引数：struct NUMBER* a : 乱数を格納する数字, int k : 生成する乱数の桁数
//戻値：なし
///////////////////////////////////////////////////////////////////
void setRnd(struct NUMBER* a, int k)
{
	int i;
	//数字
	for (i = 0; i < k; i++)
		a->n[i] = rand() % 10;
	//符号
	a->sign = (rand() % 2 == 1) ? 1 : -1;
}


///////////////////////////////////////////////////////////////////
//概要：多倍長演算用の数字をコピーする
//引数：struct NUMBER* a : コピーする数字, struct NUMBER* b : コピーされる数字
//戻値：なし
///////////////////////////////////////////////////////////////////
void copyNumber(struct NUMBER* a, struct NUMBER* b)
{
	int i;
	//数字
	for (i = 0; i < KETA; i++)
		b->n[i] = a->n[i];
	//符号
	b->sign = a->sign;
}


///////////////////////////////////////////////////////////////////
//概要：多倍長演算用の数字の絶対値を求めて格納する
//引数：struct NUMBER* a : 絶対値を求める数字, int k : 絶対値を格納する数字
//戻値：なし
///////////////////////////////////////////////////////////////////
void getAbs(struct NUMBER* a, struct NUMBER* b)
{
	copyNumber(a, b);
	b->sign = 1;
}


///////////////////////////////////////////////////////////////////
//概要：多倍長演算用の数字が0かどうかを判別する
//引数：struct NUMBER* a : 判別する数字
//戻値：0のとき : 0, それ以外のとき : -1
///////////////////////////////////////////////////////////////////
int isZero(struct NUMBER* a)
{
	if (a->sign == -1)
		return -1;

	int i;
	for (i = 0; i < KETA; i++)
		if (a->n[i] != 0)
			return -1;

	return 0;
}


///////////////////////////////////////////////////////////////////
//概要：多倍長演算用の数字を10倍して格納する
//引数：struct NUMBER* a : 10倍したい数字, struct NUMBER* b : 計算した値を格納する数字
//戻値：成功 : 0, 桁あふれ : -1(bの値は変化しない)
///////////////////////////////////////////////////////////////////
int mulBy10(struct NUMBER* a, struct NUMBER* b)
{
	int i;

	if (a->n[KETA - 1] != 0)
		return -1;

	for (i = 0; i < KETA - 1; i++)
		b->n[i + 1] = a->n[i];

	b->n[0] = 0;
	b->sign = a->sign;

	return 0;
}


///////////////////////////////////////////////////////////////////
//概要：多倍長演算用の数字を10で割った商を格納する
//引数：struct NUMBER* a : 1/10にしたい数字, struct NUMBER* b : 計算した値を格納する数字
//戻値：成功 : 余り
///////////////////////////////////////////////////////////////////
int divBy10(struct NUMBER* a, struct NUMBER* b)
{
	int i;
	for (i = 1; i < KETA; i++)
		b->n[i - 1] = a->n[i];

	b->n[KETA - 1] = 0;
	b->sign = a->sign;

	return a->n[0];
}

///////////////////////////////////////////////////////////////////
//概要：多倍長演算用の数字にint型の数字を格納する
//引数：struct NUMBER* a : 格納される数字, int x : 格納したい数字
//戻値：成功 : 0,失敗 : -1(aの値は変化しない)
///////////////////////////////////////////////////////////////////
int setInt(struct NUMBER* a, int x)
{
	int i = 1, tmp = x < 0 ? ~x + 1 : x;

	while ((tmp /= 10) > 0)
		i++;

	if (i > KETA)
		return -1;

	i = 0;
	clearByZero(a);

	if (x < 0)
		x = ~x + 1/*わんちゃん*-1でもコンパイラで処理される*/, a->sign = -1;
	else
		a->sign = -1;

	while (x > 0)
		x = (x - (a->n[i++] = x % 10)) / 10;

	return 0;
}